app/Http/Controllers/BookController.php


        // NOTE: how to cache data
        $cacheKey = 'books:' . $filter . ':' . $title;
        $books = cache()->remember($cacheKey, 3600, fn() => $books->get());
---
select * from `books` where `title` LIKE '%eit%' order by `created_at` desc

    public function show(Book $book)
    {
        $cacheKey = 'book:' . $book->id;

        $book = cache()->remember($cacheKey, 3600, fn() => $book->load([ // NOTE: lazy eager loading
            'reviews' => fn($query) => $query->latest()
        ]));
---
select * from `reviews` where `reviews`.`book_id` in (83) order by `created_at` desc